Revit 2015 API
ViewSheet.GetAdditionalProjectRevisionIds Method
 Gets the Revisions that are additionally included in the sheet's revision schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetAdditionalRevisionIds() instead.")]
public ICollection<ElementId> GetAdditionalProjectRevisionIds()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetAdditionalRevisionIds() instead.")> _
Public Function GetAdditionalProjectRevisionIds As ICollection(Of ElementId)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use GetAdditionalRevisionIds() instead.")]
public:
ICollection<ElementId^>^ GetAdditionalProjectRevisionIds()
Return Value
 The additionally included Revisions for the sheet's revision schedules.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace